Revit 2024 API
BuiltInFailures.FamilyFailures.ColumnAndTargetAlreadyJoined Property
 The column and target are joined, remove that join before attaching them.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ColumnAndTargetAlreadyJoined { get; }
Visual Basic
Public Shared ReadOnly Property ColumnAndTargetAlreadyJoined As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ColumnAndTargetAlreadyJoined {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace